test/0.org/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
	type	fixedValue;
	value	uniform 0;
//        type    zeroGradient;
    }
    sidesAndBottom
    {
	type	fixedValue;
	value	uniform 0;
//        type    zeroGradient;
    }
    frontAndBack
    {
	type	fixedValue;
	value	uniform 0;
//        type    zeroGradient;
    }
}

// ************************************************************************* //
